docjyJ/ESP8266_WS2812B_Web/src/server/Pattern/Pattern.cpp
#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    } else // other PORT(s)
#endif // defined(PORTB/C/F)
#endif // defined(PORTD)

      // PORTB OUTPUT ----------------------------------------------------

#if defined(PORTB)
#if defined(PORTD) || defined(PORTC) || defined(PORTF)
      if (port == &PORTB) {
#endif // defined(PORTD/C/F)

        // Same as above, just switched to PORTB and stripped of comments.
        hi = PORTB |  pinMask;
        lo = PORTB & ~pinMask;
        n1 = lo;
        if (b & 0x80) n1 = hi;

        asm volatile(
          "headB:"                   "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n2]   , %[lo]"    "\n\t"
          "out  %[port] , %[n1]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 6"        "\n\t"
          "mov %[n2]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n1]   , %[lo]"    "\n\t"
          "out  %[port] , %[n2]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 5"        "\n\t"
          "mov %[n1]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n2]   , %[lo]"    "\n\t"
          "out  %[port] , %[n1]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 4"        "\n\t"
          "mov %[n2]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n1]   , %[lo]"    "\n\t"
          "out  %[port] , %[n2]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 3"        "\n\t"
          "mov %[n1]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n2]   , %[lo]"    "\n\t"
          "out  %[port] , %[n1]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 2"        "\n\t"
          "mov %[n2]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n1]   , %[lo]"    "\n\t"
          "out  %[port] , %[n2]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 1"        "\n\t"
          "mov %[n1]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n2]   , %[lo]"    "\n\t"
          "out  %[port] , %[n1]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "sbrc %[byte] , 0"        "\n\t"
          "mov %[n2]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "sbiw %[count], 1"        "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "mov  %[n1]   , %[lo]"    "\n\t"
          "out  %[port] , %[n2]"    "\n\t"
          "ld   %[byte] , %a[ptr]+" "\n\t"
          "sbrc %[byte] , 7"        "\n\t"
          "mov %[n1]   , %[hi]"    "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "brne headB"              "\n"
          : [byte] "+r" (b), [n1] "+r" (n1), [n2] "+r" (n2), [count] "+w" (i)
          : [port] "I" (_SFR_IO_ADDR(PORTB)), [ptr] "e" (ptr), [hi] "r" (hi),
          [lo] "r" (lo));

#if defined(PORTD) || defined(PORTC) || defined(PORTF)
      }
#endif
#if defined(PORTC) || defined(PORTF)
      else
#endif // defined(PORTC/F)
#endif // defined(PORTB)

        // PORTC OUTPUT ----------------------------------------------------

#if defined(PORTC)
#if defined(PORTD) || defined(PORTB) || defined(PORTF)
        if (port == &PORTC) {
#endif // defined(PORTD/B/F)

          // Same as above, just switched to PORTC and stripped of comments.
          hi = PORTC |  pinMask;
          lo = PORTC & ~pinMask;
          n1 = lo;
          if (b & 0x80) n1 = hi;

          asm volatile(
            "headC:"                   "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n2]   , %[lo]"    "\n\t"
            "out  %[port] , %[n1]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 6"        "\n\t"
            "mov %[n2]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n1]   , %[lo]"    "\n\t"
            "out  %[port] , %[n2]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 5"        "\n\t"
            "mov %[n1]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n2]   , %[lo]"    "\n\t"
            "out  %[port] , %[n1]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 4"        "\n\t"
            "mov %[n2]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n1]   , %[lo]"    "\n\t"
            "out  %[port] , %[n2]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 3"        "\n\t"
            "mov %[n1]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n2]   , %[lo]"    "\n\t"
            "out  %[port] , %[n1]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 2"        "\n\t"
            "mov %[n2]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n1]   , %[lo]"    "\n\t"
            "out  %[port] , %[n2]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 1"        "\n\t"
            "mov %[n1]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n2]   , %[lo]"    "\n\t"
            "out  %[port] , %[n1]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "sbrc %[byte] , 0"        "\n\t"
            "mov %[n2]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "sbiw %[count], 1"        "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "mov  %[n1]   , %[lo]"    "\n\t"
            "out  %[port] , %[n2]"    "\n\t"
            "ld   %[byte] , %a[ptr]+" "\n\t"
            "sbrc %[byte] , 7"        "\n\t"
            "mov %[n1]   , %[hi]"    "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "brne headC"              "\n"
            : [byte] "+r" (b), [n1] "+r" (n1), [n2] "+r" (n2), [count] "+w" (i)
            : [port] "I" (_SFR_IO_ADDR(PORTC)), [ptr] "e" (ptr), [hi] "r" (hi),
            [lo] "r" (lo));

