docjyJ/ESP8266_WS2812B_Web/src/server/Pattern/Pattern.cpp
#if defined(PORTD) || defined(PORTB) || defined(PORTF)
        }
#endif // defined(PORTD/B/F)
#if defined(PORTF)
        else
#endif
#endif // defined(PORTC)

          // PORTF OUTPUT ----------------------------------------------------

#if defined(PORTF)
#if defined(PORTD) || defined(PORTB) || defined(PORTC)
          if (port == &PORTF) {
#endif // defined(PORTD/B/C)

            hi = PORTF |  pinMask;
            lo = PORTF & ~pinMask;
            n1 = lo;
            if (b & 0x80) n1 = hi;

            asm volatile(
              "headF:"                   "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n2]   , %[lo]"    "\n\t"
              "out  %[port] , %[n1]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 6"        "\n\t"
              "mov %[n2]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n1]   , %[lo]"    "\n\t"
              "out  %[port] , %[n2]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 5"        "\n\t"
              "mov %[n1]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n2]   , %[lo]"    "\n\t"
              "out  %[port] , %[n1]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 4"        "\n\t"
              "mov %[n2]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n1]   , %[lo]"    "\n\t"
              "out  %[port] , %[n2]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 3"        "\n\t"
              "mov %[n1]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n2]   , %[lo]"    "\n\t"
              "out  %[port] , %[n1]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 2"        "\n\t"
              "mov %[n2]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n1]   , %[lo]"    "\n\t"
              "out  %[port] , %[n2]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 1"        "\n\t"
              "mov %[n1]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n2]   , %[lo]"    "\n\t"
              "out  %[port] , %[n1]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "sbrc %[byte] , 0"        "\n\t"
              "mov %[n2]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "sbiw %[count], 1"        "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "mov  %[n1]   , %[lo]"    "\n\t"
              "out  %[port] , %[n2]"    "\n\t"
              "ld   %[byte] , %a[ptr]+" "\n\t"
              "sbrc %[byte] , 7"        "\n\t"
              "mov %[n1]   , %[hi]"    "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "brne headF"              "\n"
              : [byte] "+r" (b), [n1] "+r" (n1), [n2] "+r" (n2), [count] "+w" (i)
              : [port] "I" (_SFR_IO_ADDR(PORTF)), [ptr] "e" (ptr), [hi] "r" (hi),
              [lo] "r" (lo));

#if defined(PORTD) || defined(PORTB) || defined(PORTC)
          }
#endif // defined(PORTD/B/C)
#endif // defined(PORTF)

#if defined(NEO_KHZ400)
  } else { // end 800 KHz, do 400 KHz

    volatile uint8_t next, bit;

    hi   = *port |  pinMask;
    lo   = *port & ~pinMask;
    next = lo;
    bit  = 8;

    asm volatile(
      "head20:"                  "\n\t" // Clk  Pseudocode    (T =  0)
      "st   %a[port], %[hi]"    "\n\t" // 2    PORT = hi     (T =  2)
      "sbrc %[byte] , 7"        "\n\t" // 1-2  if(b & 128)
      "mov  %[next], %[hi]"    "\n\t" // 0-1   next = hi    (T =  4)
      "st   %a[port], %[next]"  "\n\t" // 2    PORT = next   (T =  6)
      "mov  %[next] , %[lo]"    "\n\t" // 1    next = lo     (T =  7)
      "dec  %[bit]"             "\n\t" // 1    bit--         (T =  8)
      "breq nextbyte20"         "\n\t" // 1-2  if(bit == 0)
      "rol  %[byte]"            "\n\t" // 1    b <<= 1       (T = 10)
      "st   %a[port], %[lo]"    "\n\t" // 2    PORT = lo     (T = 12)
      "rjmp .+0"                "\n\t" // 2    nop nop       (T = 14)
      "rjmp .+0"                "\n\t" // 2    nop nop       (T = 16)
      "rjmp .+0"                "\n\t" // 2    nop nop       (T = 18)
      "rjmp head20"             "\n\t" // 2    -> head20 (next bit out)
      "nextbyte20:"              "\n\t" //                    (T = 10)
      "st   %a[port], %[lo]"    "\n\t" // 2    PORT = lo     (T = 12)
      "nop"                     "\n\t" // 1    nop           (T = 13)
      "ldi  %[bit]  , 8"        "\n\t" // 1    bit = 8       (T = 14)
      "ld   %[byte] , %a[ptr]+" "\n\t" // 2    b = *ptr++    (T = 16)
      "sbiw %[count], 1"        "\n\t" // 2    i--           (T = 18)
      "brne head20"             "\n"   // 2    if(i != 0) -> (next byte)
      : [port]  "+e" (port),
      [byte]  "+r" (b),
      [bit]   "+r" (bit),
      [next]  "+r" (next),
      [count] "+w" (i)
      : [hi]    "r" (hi),
      [lo]    "r" (lo),
      [ptr]   "e" (ptr));
  }
#endif // NEO_KHZ400

  // 12 MHz(ish) AVR --------------------------------------------------------
#elif (F_CPU >= 11100000UL) && (F_CPU <= 14300000UL)

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif

    volatile uint8_t next;

    // PORTD OUTPUT ----------------------------------------------------

#if defined(PORTD)
#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    if (port == &PORTD) {
#endif // defined(PORTB/C/F)

      hi   = PORTD |  pinMask;
      lo   = PORTD & ~pinMask;
      next = lo;
      if (b & 0x80) next = hi;

      asm volatile(
        "headD:"                   "\n\t" //        (T =  0)
        "out   %[port], %[hi]"    "\n\t" //        (T =  1)
        "rcall bitTimeD"          "\n\t" // Bit 7  (T = 15)
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 6
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 5
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 4
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 3
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 2
        "out   %[port], %[hi]"    "\n\t"
        "rcall bitTimeD"          "\n\t" // Bit 1
        // Bit 0:
        "out  %[port] , %[hi]"    "\n\t" // 1    PORT = hi    (T =  1)
        "rjmp .+0"                "\n\t" // 2    nop nop      (T =  3)
        "ld   %[byte] , %a[ptr]+" "\n\t" // 2    b = *ptr++   (T =  5)
        "out  %[port] , %[next]"  "\n\t" // 1    PORT = next  (T =  6)
        "mov  %[next] , %[lo]"    "\n\t" // 1    next = lo    (T =  7)
        "sbrc %[byte] , 7"        "\n\t" // 1-2  if(b & 0x80) (T =  8)
        "mov %[next] , %[hi]"    "\n\t" // 0-1    next = hi  (T =  9)
        "nop"                     "\n\t" // 1                 (T = 10)
        "out  %[port] , %[lo]"    "\n\t" // 1    PORT = lo    (T = 11)
        "sbiw %[count], 1"        "\n\t" // 2    i--          (T = 13)
        "brne headD"              "\n\t" // 2    if(i != 0) -> (next byte)
        "rjmp doneD"             "\n\t"
        "bitTimeD:"               "\n\t" //      nop nop nop     (T =  4)
        "out  %[port], %[next]"  "\n\t" // 1    PORT = next     (T =  5)
        "mov  %[next], %[lo]"    "\n\t" // 1    next = lo       (T =  6)
        "rol  %[byte]"           "\n\t" // 1    b <<= 1         (T =  7)
        "sbrc %[byte], 7"        "\n\t" // 1-2  if(b & 0x80)    (T =  8)
        "mov %[next], %[hi]"    "\n\t" // 0-1   next = hi      (T =  9)
        "nop"                    "\n\t" // 1                    (T = 10)
        "out  %[port], %[lo]"    "\n\t" // 1    PORT = lo       (T = 11)
        "ret"                    "\n\t" // 4    nop nop nop nop (T = 15)
        "doneD:"                 "\n"
        : [byte]  "+r" (b),
        [next]  "+r" (next),
        [count] "+w" (i)
        : [port]   "I" (_SFR_IO_ADDR(PORTD)),
        [ptr]    "e" (ptr),
        [hi]     "r" (hi),
        [lo]     "r" (lo));

