docjyJ/ESP8266_WS2812B_Web/src/server/Pattern/Pattern.cpp
#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    } else // other PORT(s)
#endif // defined(PORTB/C/F)
#endif // defined(PORTD)

      // PORTB OUTPUT ----------------------------------------------------

#if defined(PORTB)
#if defined(PORTD) || defined(PORTC) || defined(PORTF)
      if (port == &PORTB) {
#endif // defined(PORTD/C/F)

        hi   = PORTB |  pinMask;
        lo   = PORTB & ~pinMask;
        next = lo;
        if (b & 0x80) next = hi;

        // Same as above, just set for PORTB & stripped of comments
        asm volatile(
          "headB:"                   "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out   %[port], %[hi]"    "\n\t"
          "rcall bitTimeB"          "\n\t"
          "out  %[port] , %[hi]"    "\n\t"
          "rjmp .+0"                "\n\t"
          "ld   %[byte] , %a[ptr]+" "\n\t"
          "out  %[port] , %[next]"  "\n\t"
          "mov  %[next] , %[lo]"    "\n\t"
          "sbrc %[byte] , 7"        "\n\t"
          "mov %[next] , %[hi]"    "\n\t"
          "nop"                     "\n\t"
          "out  %[port] , %[lo]"    "\n\t"
          "sbiw %[count], 1"        "\n\t"
          "brne headB"              "\n\t"
          "rjmp doneB"             "\n\t"
          "bitTimeB:"               "\n\t"
          "out  %[port], %[next]"  "\n\t"
          "mov  %[next], %[lo]"    "\n\t"
          "rol  %[byte]"           "\n\t"
          "sbrc %[byte], 7"        "\n\t"
          "mov %[next], %[hi]"    "\n\t"
          "nop"                    "\n\t"
          "out  %[port], %[lo]"    "\n\t"
          "ret"                    "\n\t"
          "doneB:"                 "\n"
          : [byte] "+r" (b), [next] "+r" (next), [count] "+w" (i)
          : [port] "I" (_SFR_IO_ADDR(PORTB)), [ptr] "e" (ptr), [hi] "r" (hi),
          [lo] "r" (lo));

#if defined(PORTD) || defined(PORTC) || defined(PORTF)
      }
#endif
#if defined(PORTC) || defined(PORTF)
      else
#endif // defined(PORTC/F)
#endif // defined(PORTB)

        // PORTC OUTPUT ----------------------------------------------------

#if defined(PORTC)
#if defined(PORTD) || defined(PORTB) || defined(PORTF)
        if (port == &PORTC) {
#endif // defined(PORTD/B/F)

          hi   = PORTC |  pinMask;
          lo   = PORTC & ~pinMask;
          next = lo;
          if (b & 0x80) next = hi;

          // Same as above, just set for PORTC & stripped of comments
          asm volatile(
            "headC:"                   "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out   %[port], %[hi]"    "\n\t"
            "rcall bitTimeC"          "\n\t"
            "out  %[port] , %[hi]"    "\n\t"
            "rjmp .+0"                "\n\t"
            "ld   %[byte] , %a[ptr]+" "\n\t"
            "out  %[port] , %[next]"  "\n\t"
            "mov  %[next] , %[lo]"    "\n\t"
            "sbrc %[byte] , 7"        "\n\t"
            "mov %[next] , %[hi]"    "\n\t"
            "nop"                     "\n\t"
            "out  %[port] , %[lo]"    "\n\t"
            "sbiw %[count], 1"        "\n\t"
            "brne headC"              "\n\t"
            "rjmp doneC"             "\n\t"
            "bitTimeC:"               "\n\t"
            "out  %[port], %[next]"  "\n\t"
            "mov  %[next], %[lo]"    "\n\t"
            "rol  %[byte]"           "\n\t"
            "sbrc %[byte], 7"        "\n\t"
            "mov %[next], %[hi]"    "\n\t"
            "nop"                    "\n\t"
            "out  %[port], %[lo]"    "\n\t"
            "ret"                    "\n\t"
            "doneC:"                 "\n"
            : [byte] "+r" (b), [next] "+r" (next), [count] "+w" (i)
            : [port] "I" (_SFR_IO_ADDR(PORTC)), [ptr] "e" (ptr), [hi] "r" (hi),
            [lo] "r" (lo));

#if defined(PORTD) || defined(PORTB) || defined(PORTF)
        }
#endif // defined(PORTD/B/F)
#if defined(PORTF)
        else
#endif
#endif // defined(PORTC)

          // PORTF OUTPUT ----------------------------------------------------

#if defined(PORTF)
#if defined(PORTD) || defined(PORTB) || defined(PORTC)
          if (port == &PORTF) {
#endif // defined(PORTD/B/C)

            hi   = PORTF |  pinMask;
            lo   = PORTF & ~pinMask;
            next = lo;
            if (b & 0x80) next = hi;

            // Same as above, just set for PORTF & stripped of comments
            asm volatile(
              "headF:"                   "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out   %[port], %[hi]"    "\n\t"
              "rcall bitTimeC"          "\n\t"
              "out  %[port] , %[hi]"    "\n\t"
              "rjmp .+0"                "\n\t"
              "ld   %[byte] , %a[ptr]+" "\n\t"
              "out  %[port] , %[next]"  "\n\t"
              "mov  %[next] , %[lo]"    "\n\t"
              "sbrc %[byte] , 7"        "\n\t"
              "mov %[next] , %[hi]"    "\n\t"
              "nop"                     "\n\t"
              "out  %[port] , %[lo]"    "\n\t"
              "sbiw %[count], 1"        "\n\t"
              "brne headF"              "\n\t"
              "rjmp doneC"             "\n\t"
              "bitTimeC:"               "\n\t"
              "out  %[port], %[next]"  "\n\t"
              "mov  %[next], %[lo]"    "\n\t"
              "rol  %[byte]"           "\n\t"
              "sbrc %[byte], 7"        "\n\t"
              "mov %[next], %[hi]"    "\n\t"
              "nop"                    "\n\t"
              "out  %[port], %[lo]"    "\n\t"
              "ret"                    "\n\t"
              "doneC:"                 "\n"
              : [byte] "+r" (b), [next] "+r" (next), [count] "+w" (i)
              : [port] "I" (_SFR_IO_ADDR(PORTF)), [ptr] "e" (ptr), [hi] "r" (hi),
              [lo] "r" (lo));

#if defined(PORTD) || defined(PORTB) || defined(PORTC)
          }
#endif // defined(PORTD/B/C)
#endif // defined(PORTF)

#if defined(NEO_KHZ400)
  } else { // 400 KHz

    // 30 instruction clocks per bit: HHHHHHxxxxxxxxxLLLLLLLLLLLLLLL
    // ST instructions:               ^     ^        ^    (T=0,6,15)

    volatile uint8_t next, bit;

