docjyJ/ESP8266_WS2812B_Web/src/server/Pattern/Pattern.cpp
#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif
    cyc = ARM_DWT_CYCCNT + CYCLES_800;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        while (ARM_DWT_CYCCNT - cyc < CYCLES_800);
        cyc  = ARM_DWT_CYCCNT;
        *set = 1;
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T1H);
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T0H);
        }
        *clr = 1;
      }
    }
    while (ARM_DWT_CYCCNT - cyc < CYCLES_800);
#if defined(NEO_KHZ400)
  } else { // 400 kHz bitstream
    cyc = ARM_DWT_CYCCNT + CYCLES_400;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        while (ARM_DWT_CYCCNT - cyc < CYCLES_400);
        cyc  = ARM_DWT_CYCCNT;
        *set = 1;
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T1H);
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T0H);
        }
        *clr = 1;
      }
    }
    while (ARM_DWT_CYCCNT - cyc < CYCLES_400);
  }
#endif // NEO_KHZ400

#elif defined(TEENSYDUINO) && (defined(__IMXRT1052__) || defined(__IMXRT1062__))
#define CYCLES_800_T0H  (F_CPU_ACTUAL / 4000000)
#define CYCLES_800_T1H  (F_CPU_ACTUAL / 1250000)
#define CYCLES_800      (F_CPU_ACTUAL /  800000)
#define CYCLES_400_T0H  (F_CPU_ACTUAL / 2000000)
#define CYCLES_400_T1H  (F_CPU_ACTUAL /  833333)
#define CYCLES_400      (F_CPU_ACTUAL /  400000)

  uint8_t           *p   = pixels,
                     *end = p + numBytes, pix, mask;
  volatile uint32_t *set = portSetRegister(pin),
                     *clr = portClearRegister(pin);
  uint32_t          cyc,
                    msk = digitalPinToBitMask(pin);

  ARM_DEMCR    |= ARM_DEMCR_TRCENA;
  ARM_DWT_CTRL |= ARM_DWT_CTRL_CYCCNTENA;

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif
    cyc = ARM_DWT_CYCCNT + CYCLES_800;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        while (ARM_DWT_CYCCNT - cyc < CYCLES_800);
        cyc  = ARM_DWT_CYCCNT;
        *set = msk;
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T1H);
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_800_T0H);
        }
        *clr = msk;
      }
    }
    while (ARM_DWT_CYCCNT - cyc < CYCLES_800);
#if defined(NEO_KHZ400)
  } else { // 400 kHz bitstream
    cyc = ARM_DWT_CYCCNT + CYCLES_400;
    while (p < end) {
      pix = *p++;
      for (mask = 0x80; mask; mask >>= 1) {
        while (ARM_DWT_CYCCNT - cyc < CYCLES_400);
        cyc  = ARM_DWT_CYCCNT;
        *set = msk;
        if (pix & mask) {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T1H);
        } else {
          while (ARM_DWT_CYCCNT - cyc < CYCLES_400_T0H);
        }
        *clr = msk;
      }
    }
    while (ARM_DWT_CYCCNT - cyc < CYCLES_400);
  }
#endif // NEO_KHZ400

#elif defined(TEENSYDUINO) && defined(__MKL26Z64__) // Teensy-LC

#if F_CPU == 48000000
  uint8_t          *p   = pixels,
                    pix, count, dly,
                    bitmask = digitalPinToBitMask(pin);
  volatile uint8_t *reg = portSetRegister(pin);
  uint32_t          num = numBytes;
  asm volatile(
    "L%=_begin:"                      "\n\t"
    "ldrb  %[pix], [%[p], #0]"       "\n\t"
    "lsl   %[pix], #24"              "\n\t"
    "movs  %[count], #7"             "\n\t"
    "L%=_loop:"                       "\n\t"
    "lsl   %[pix], #1"               "\n\t"
    "bcs   L%=_loop_one"             "\n\t"
    "L%=_loop_zero:"                 "\n\t"
    "strb  %[bitmask], [%[reg], #0]" "\n\t"
    "movs  %[dly], #4"               "\n\t"
    "L%=_loop_delay_T0H:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_loop_delay_T0H"       "\n\t"
    "strb  %[bitmask], [%[reg], #4]" "\n\t"
    "movs  %[dly], #13"              "\n\t"
    "L%=_loop_delay_T0L:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_loop_delay_T0L"       "\n\t"
    "b     L%=_next"                 "\n\t"
    "L%=_loop_one:"                   "\n\t"
    "strb  %[bitmask], [%[reg], #0]" "\n\t"
    "movs  %[dly], #13"              "\n\t"
    "L%=_loop_delay_T1H:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_loop_delay_T1H"       "\n\t"
    "strb  %[bitmask], [%[reg], #4]" "\n\t"
    "movs  %[dly], #4"               "\n\t"
    "L%=_loop_delay_T1L:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_loop_delay_T1L"       "\n\t"
    "nop"                            "\n\t"
    "L%=_next:"                       "\n\t"
    "sub   %[count], #1"             "\n\t"
    "bne   L%=_loop"                 "\n\t"
    "lsl   %[pix], #1"               "\n\t"
    "bcs   L%=_last_one"             "\n\t"
    "L%=_last_zero:"                  "\n\t"
    "strb  %[bitmask], [%[reg], #0]" "\n\t"
    "movs  %[dly], #4"               "\n\t"
    "L%=_last_delay_T0H:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_last_delay_T0H"       "\n\t"
    "strb  %[bitmask], [%[reg], #4]" "\n\t"
    "movs  %[dly], #10"              "\n\t"
    "L%=_last_delay_T0L:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_last_delay_T0L"       "\n\t"
    "b     L%=_repeat"               "\n\t"
    "L%=_last_one:"                   "\n\t"
    "strb  %[bitmask], [%[reg], #0]" "\n\t"
    "movs  %[dly], #13"              "\n\t"
    "L%=_last_delay_T1H:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_last_delay_T1H"       "\n\t"
    "strb  %[bitmask], [%[reg], #4]" "\n\t"
    "movs  %[dly], #1"               "\n\t"
    "L%=_last_delay_T1L:"             "\n\t"
    "sub   %[dly], #1"               "\n\t"
    "bne   L%=_last_delay_T1L"       "\n\t"
    "nop"                            "\n\t"
    "L%=_repeat:"                     "\n\t"
    "add   %[p], #1"                 "\n\t"
    "sub   %[num], #1"               "\n\t"
    "bne   L%=_begin"                "\n\t"
    "L%=_done:"                       "\n\t"
    : [p]       "+r"  (p),
    [pix]     "=&r" (pix),
    [count]   "=&r" (count),
    [dly]     "=&r" (dly),
    [num]     "+r"  (num)
    : [bitmask] "r"   (bitmask),
    [reg]     "r"   (reg)
  );
#else
#error "Sorry, only 48 MHz is supported, please set Tools > CPU Speed to 48 MHz"
#endif // F_CPU == 48000000

  // Begin of support for nRF52 based boards  -------------------------

#elif defined(NRF52) || defined(NRF52_SERIES)
  / #define MAGIC_T0H               6UL | (0x8000) // 0.375us
#define MAGIC_T1H              13UL | (0x8000) // 0.8125us

  // WS2811 (400 khz) timing is 0.5 and 1.2
#define MAGIC_T0H_400KHz        8UL  | (0x8000) // 0.5us
#define MAGIC_T1H_400KHz        19UL | (0x8000) // 1.1875us

